m = int(input("Номер масти (1-4): "))
k = int(input("Номер достоинства карты (6-14): "))
# Достоинство
if k == 6:
    k1 = "шестерка"
elif k == 7:
    k1 = "семерка"
elif k == 8:
    k1 = "восьмерка"
elif k == 9:
    k1 = "девятка"
elif k == 10:
    k1 = "десятка"
elif k == 11:
    k1 = "Валет"
elif k == 12:
    k1 = "Дама"
elif k == 13:
    k1 = "Король"
elif k == 14:
    k1 = "Туз"
# Масть
if m == 1:
    m1 = "пик"
if m == 2:
    m1 = "треф"
if m == 3:
    m1 = "бубен"
if m == 4:
    m1 = "черв"
print(k1, m1)
